website/EN/installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-15 Thu 21:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LibreServer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bob Mottram" />
<meta name="description" content="LibreServer installation"
 />
<meta name="keywords" content="libreserver, installation, self-hosting" />
<link rel="stylesheet" type="text/css" href="libreserver.css" />
</head>
<body>
<div id="content">
<h1 class="title">LibreServer</h1>

<div id="outline-container-orgd0cb34c" class="outline-2">
<h2 id="orgd0cb34c">Installation</h2>
<div class="outline-text-2" id="text-orgd0cb34c">
</div>
<div id="outline-container-orge41b74a" class="outline-3">
<h3 id="orge41b74a">1. Download</h3>
<div class="outline-text-3" id="text-orge41b74a">
<p>
<a href="https://libreserver.org/downloads">Download the disk image</a> for your server architecture.
</p>
</div>
</div>

<div id="outline-container-org24992f3" class="outline-3">
<h3 id="org24992f3">2. Copy to drive</h3>
<div class="outline-text-3" id="text-org24992f3">
<p>
In a terminal, copy the image to your drive. This could be microSD, a USB stick or an SSD.
</p>

<div class="org-src-container">
<pre class="src src-bash">xzcat libreserver-bullseye-*-amd64.img.xz | <span style="color: #deb887;">\</span>
  sudo dd <span style="color: #4eee94;">bs</span>=4M <span style="color: #4eee94;">of</span>=/dev/sdX <span style="color: #4eee94;">conv</span>=fsync <span style="color: #4eee94;">status</span>=progress
</pre>
</div>

<p>
Where <b>sdX</b> is the name of your drive.
</p>
</div>
</div>

<div id="outline-container-orgf4149e1" class="outline-3">
<h3 id="orgf4149e1">3. Plug in</h3>
<div class="outline-text-3" id="text-orgf4149e1">
<p>
Connect everything up.
</p>

<ul class="org-ul">
<li>Ethernet cable between your internet router and your server.</li>
<li>Plug in the drive.</li>
<li>Connect power supply.</li>
</ul>

<p>
If your server fails to boot then go back to step 2 and try writing to the drive again, or using a different drive. Sometimes copying the image to the drive is not always entirely reliable.
</p>
</div>
</div>

<div id="outline-container-orga414195" class="outline-3">
<h3 id="orga414195">4. Locate on the network</h3>
<div class="outline-text-3" id="text-orga414195">
<p>
Find you server's local IP address. It will usually start with 192.168.. A typical way to do this is to log in to your internet router and show the list of devices on your local network.
</p>
</div>
</div>

<div id="outline-container-org6081c18" class="outline-3">
<h3 id="org6081c18">5. Log in</h3>
<div class="outline-text-3" id="text-org6081c18">
<p>
Log into your server using ssh.
</p>

<div class="org-src-container">
<pre class="src src-bash">ssh admin@192.168.x.y
</pre>
</div>

<p>
The initial password is <b><b>libreserver</b></b>. On first login you will be asked to change this and the server will log you out again. Log back in with your chosen password. Note that <i>the password that you entered is temporary</i> and will be thrown away when installation is complete.
</p>
</div>
</div>

<div id="outline-container-orgcb69e0f" class="outline-3">
<h3 id="orgcb69e0f">6. Start the install</h3>
<div class="outline-text-3" id="text-orgcb69e0f">
<p>
Follow the instructions to begin the install. Typically this will be:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo libreserver menuconfig
</pre>
</div>

<p>
or for the onion version:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo libreserver menuconfig-onion
</pre>
</div>

<p>
You will be prompted to select a language and then be given a new password. Write this down or store it in a password manager.
</p>

<p>
If you are not installing the onion version then you will be also be asked for dynamic DNS and domain name. The domain name must be one which you own, and not a <i>free-as-in-gratis</i> subdomain.
</p>

<p>
Installation may take a long time - possibly up to a few hours - depending on your type of drive and internet bandwidth, but you can leave it running unattended. microSD cards and USB sticks are typically quite slow (unless it's USB3 and your hardware has USB3 sockets).
</p>
</div>
</div>

<div id="outline-container-orgc853c37" class="outline-3">
<h3 id="orgc853c37">7. Browse to admin</h3>
<div class="outline-text-3" id="text-orgc853c37">
<p>
When installation is complete you can log into your server with a browser.
</p>

<div class="org-src-container">
<pre class="src src-bash">http://192.168.x.y/admin
</pre>
</div>

<p>
The username is <b><b>admin</b></b> and the password is the one you wrote down previously.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bob Mottram</p>
<p class="date">Created: 2021-04-15 Thu 21:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
